org/page/publication.org
#+OPTIONS:   H:4 num:nil toc:nil author:nil timestamp:nil tex:t 
#+BEGIN_EXPORT HTML
---
layout: page
title: Publication
---
#+END_EXPORT

My [[https://scholar.google.com.sg/citations?user=UcpEexUAAAAJ][Google Scholar]] and [[https://www.researchgate.net/profile/Yilin_Mo][Research Gate]] Page.

* Journal Paper
1. Liang Xu, Yilin Mo and Lihua Xie, /Distributed Consensus over Markovian Packet Loss Channels/, *IEEE Transactions on Automatic Control*, Submitted
2. Xinghua Liu, Yilin Mo and Emanuele Garone, /Local Decompostion of Kalman Filters and Its Application for Secure State Estimation/, *IEEE Transactions on Automatic Control*, Submitted
3. Jiazheng Wang, Xiaoqiang Ren, Yilin Mo and Ling Shi, /Whittle's Index Policy for Dynamic Multi-channel Allocation for Remote State Estimation/, *IEEE Transactions on Automatic Control*, Submitted
4. Duo Han, Yilin Mo and Lihua Xie, [[file:papers/automatica-16-secureest.org][/Convex Optimization Based State Estimation against Sparse Integrity Attacks/]], *IEEE Transactions on Automatic Control*, Accepted
5. Yorie Nakahira and Yilin Mo, /Attack-Resilient H2, H-infinity, and L1 State Estimator/, *IEEE Transactions on Automatic Control*, Available Online: DOI:10.1109/TAC.2018.2819686
6. Xiaoqiang Ren and Yilin Mo, /Secure Detection: Performance Metric and Sensor Deployment Strategy/, *IEEE Transactions on Signal Processing*, Sep 2018, Volume 66, Issue 17, Pages 4450-4460
7. Xiaoqiang Ren, Jiaqi Yan and Yilin Mo, [[file:papers/tsp-17-detection.org][/Binary Hypothesis Testing with Byzantine Sensors: Fundamental Trade-off Between Security and Efficiency/]], *IEEE Transactions on Signal Processing*, Mar 2018, Volume 66, Issue 6, Pages 1454-1468
8. Duo Han, Junfeng Wu, Yilin Mo and Lihua Xie, /On Stochastic Sensor Network Scheduling for Multiple Processes/, *IEEE Transactions on Automatic Control*, Dec 2017, Volume 62, Issue 12, Pages 6633-6640
9. Liang Xu, Yilin Mo and Lihua Xie, /Mean Square Stabilization of Linear Discrete-time Systems over Power Constrained Fading Channels/, *IEEE Transactions on Automatic Control*, Dec 2017, Volume 62, Issue 12, Pages 6505-6512
10. Yilin Mo and Richard M. Murray, [[file:papers/tac-15-privacy.org][/Privacy Preserving Average Consensus/]], *IEEE Transactions on Automatic Control*, Feb 2017, Volume 62, Issue 2, Pages 753-765
11. Sean Weerakkody, Yilin Mo, Bruno Sinopoli, Duo Han, Ling Shi, /Multi-Sensor Scheduling for State Estimation with Event-Based Stochastic Triggers/, *IEEE Transactions on Automatic Control*, Sept 2016, Volume 61, Issue 9, Pages 2695-2701
12. Yilin Mo and Bruno Sinopoli, [[./papers/tac-12-integrity.org][/On the Performance Degradation of Cyber-Physical Systems under Stealthy Integrity Attacks/]], *IEEE Transactions on Automatic Control*, Sept 2016, Volume 61, Issue 9, Pages 2618-2624
13. Duo Han, Yilin Mo, Junfeng Wu and Ling Shi, /An Opportunistic Sensor Scheduling Solution to Remote State Estimation Over Multiple Channels/, *IEEE Transactions on Signal Processing*, Sept 2016, Volume 64, Issue 18, 4905-4917
14. Duo Han, Yilin Mo, Junfeng Wu, Sean Weerakkody, Bruno Sinopoli and Ling Shi, [[./papers/tac-13-event.org][/Stochastic Event-triggered Sensor Schedule for Remote State Estimation/]], *IEEE Transactions on Automatic Control*, Oct 2015, Volume 60, Issue 10, Pages 2661-2675
15. Yilin Mo and Bruno Sinopoli, /[[./papers/tac-15-est.org][Secure Estimation in the Presence of Integrity Attacks]]/, *IEEE Transactions on Automatic Control*, Apr 2015, Volume 60, Issue 4, Pages 1145-1151
16. Yilin Mo, Sean Weerakkody and Bruno Sinopoli, /[[./papers/cms-15-replay.org][Physical Authentication of Control Systems: Designing Watermarked Control Inputs to Detect Counterfeit Sensor Outputs]]/, *IEEE Control Systems Magazine*, Feb 2015, Volume 35, Issue 1, Pages 93-109
17. Yilin Mo, Rohan Chabukswar and Bruno Sinopoli, /[[./papers/tcst-14-replay.org][Detecting Integrity Attacks on SCADA Systems]]/, *IEEE Transactions on Control System Technology*, Jul 2014, Volume 22, Issue 4, 1396-1407
18. Kyriakos Vamvoudakis, Jo\atilde{}o Hespanha, Yilin Mo and Bruno Sinopoli, /[[./papers/tac-14-detection.org][Detection in Adversarial Environments]]/, *IEEE Transactions on Automatic Control, Special Issue on Control of Cyber-Physical Systems*, Dec 2014, Volume 59, Issue 12, Special Issue S1, Pages 3209-3223
19. Yilin Mo, Emanuele Garone and Bruno Sinopoli, /[[./papers/scl-14-optschedule.org][On Infinite-Horizon Sensor Scheduling]]/, *System & Control Letters*, May 2014, Volume 67, Pages 65-70,
20. Yilin Mo, Jo\atilde{}o Hespanha and Bruno Sinopoli, /[[./papers/tsp-14-detection.org][Resilient Detection in the Presence of Integrity Attacks]]/, *IEEE Transactions on Signal Processing*, Jan 2014, Volume 62, Issue 1, Pages 31-43
21. Qing-Shan Jia, Ling Shi, Yilin Mo and Bruno Sinopoli, /[[./papers/tac-12-wsn.org][On Optimal Partial Broadcasting of Wireless Sensor Networks for Kalman Filtering]]/, *IEEE Transactions on Automatic Control*, Mar 2012, Volum 57, Issue 3, Pages 715-721
22. Yilin Mo and Bruno Sinopoli, /[[./papers/tac12.org][Kalman Filtering with Intermittent Observations: Tail Distribution and Critical Value]]/, *IEEE Transactions on Automatic Control*, Mar 2012, Volume 57, Issue 3, Pages 677-689
23. Yilin Mo, Tiffany Hyun-Jin Kim, Kenneth Brancik, Dona Dickinson, Heejo Lee, Adrian Perrig and Bruno Sinopoli, /[[./papers/proc-ieee-12-smartgrid.org][Cyber-Physical Security of a Smart Grid Infrastructure]]/, *Proceedings of the IEEE, Special Issue on Cyber-Physical Systems*, Jan 2012, Volume 100, Issue 1, Pages 195-209
24. Le Xie, Yilin Mo and Bruno Sinopoli, /[[./papers/tsg-11-integrity.org][Integrity Data Attacks in Power Market Operations]]/, *IEEE Transactions on Smart Grid*, Dec 2011, Volume 2, Issue 4, Pages 659-666
25. Wei Wang, Yilin Mo, John A. Ozolek, Gustavo K. Rohde, /[[./papers/prl-11-fisherdiscriminant.org][Penalized Fisher Discriminant Analysis and Its Application to Image-based Morphometry]]/, *Pattern Recognition Letters*, Nov 2011, Volume 32, Issue 15, Pages 2128-2135
26. Yilin Mo, Emanuele Garone, Alessandro Casavola and Bruno Sinopoli, /[[./papers/tac-11-scheduling.org][Stochastic Sensor Scheduling for Energy Constrained Estimation in Multi-Hop Wireless Sensor Networks]]/, *IEEE Transactions on Automatic Control*, Oct 2011, Volume 56, Issue 10, Pages 2489-2495
27. Yilin Mo, Roberto Ambrosino and Bruno Sinopoli, /[[./papers/automatica-11-scheduling.org][Sensor Selection Strategies for State Estimation in Energy Constrained Wireless Sensor Networks]]/, *Automatica*, July 2011, Volume 47, Issue 7, Pages 1330-1338 
28. Ling Shi, Qing-Shan Jia, Yilin Mo and Bruno Sinopoli, /[[./papers/automatica-11-delay.org][Sensor Scheduling over a Packet-Delaying Network]]/, *Automatica*, May 2011, Volume 47, Issue 5, Pages 1089-1092 

* Selected Conference Paper
1. Hanxiao Liu, Jiaqi Yan, Yilin Mo and Karl H. Johansson, /An On-line Design of Physical Watermarks/, *IEEE Conference on Decision and Control*, Miami, United States, Dec 17-19, 2018
2. Jiaqi Yan, Xiaoqiang Ren and Yilin Mo, [[./papers/cdc17-1.org][/Sequential Detection in Adversarial Environment/]], *IEEE Conference on Decision and Control*, Melbourne, Australia, Dec 12-15, 2017
3. Xinghua Liu, Yilin Mo and Emanuele Garone, /Secure Dynamic State Estimation by Decomposing Kalman Filter/, *IFAC World Congress*, Toulouse, France, Jul 9-14, 2017
4. Yilin Mo and Emanuele Garone, [[./papers/cdc16-1.org][/Secure Dynamic State Estimation via Local Estimators/]], *IEEE Conference on Decision and Control*, Las Vegas, USA, Dec 12-14, 2016
5. Duo Han, Yilin Mo and Lihua Xie, [[./papers/acc16-1.org][/Convex Optimization Based State Estimation against Sparse Integrity Attacks/]], *Chinese Control Conference*, Chengdu, China, Jul 27-29, 2016
6. Liang Xu, Yilin Mo and Lihua Xie, /Mean Square Stabilization of Vector LTI Systems over Power Constrained Lossy Channels/, *American Control Conference*, Boston, USA, Jul 6-8, 2016
7. Ye Yuan and Yilin Mo, /[[./papers/cdc15-1.org][Security in Cyber-Physical Systems: Controller Design Against Known-Plaintext Attack]]/, *IEEE Conference on Decision and Control*, Osaka, Dec 15-18, 2015
8. Yorie Nakahira and Yilin Mo, /[[./papers/cdc15-2.org][Dyanmic State Estimation in the Presence of Compromised Sensory Data]]/, *IEEE Conference on Decision and Control*, Osaka, Dec 15-18, 2015
9. Robert Mattila, Yilin Mo and Richard M. Murray, /An Iterative Abstraction Algorithm for Reactive Correct-by-Construction Controller Synthesis/, *IEEE Conference on Decision and Control*, Osaka, Dec 15-18, 2015
10. Xiaoming Duan, Jianping He, Peng Cheng, Yilin Mo and Jiming Chen, /Privacy Preserving Maximum Consensus/, *IEEE Conference on Decision and Control*, Osaka, Dec 15-18, 2015
11. Yilin Mo and Richard M. Murray, [[./papers/ccc15.org][/Multi-dimensional state estimation in adversarial environment/]], *Chinese Control Conference*, Hangzhou, China, Jul 28-30, 2015
12. Yilin Mo and Richard M. Murray, /Privacy Preserving Average Consensus/, *IEEE Conference on Decision and Control*, Los Angeles, Dec 15-17, 2014
13. Sean Weerakkody, Yilin Mo and Bruno Sinopoli, /Detecting Integrity Attacks on Control Systems Using Robust Physical Watermarking/, *IEEE Conference on Decision and Control*, Los Angeles, Dec 15-17, 2014
14. Xiaoqiang Ren, Yilin Mo and Ling Shi, /Optimal DoS Attack on Bayesian Quickest Change Detection/, *IEEE Conference on Decision and Control*, Los Angeles, Dec 15-17, 2014
15. Sean Weerakkody, Yilin Mo, Bruno Sinopoli, Duo Han and Ling Shi, /Multi-Sensor Scheduling for State Estimation with Event-Based, Stochastic Triggers/, *4th IFAC Workshop on Distributed Estimation and Control in Networked Systems*, Koblenz, Germany, Sep 25-26, 2013
16. Rohan Chabukswar, Yilin Mo and Bruno Sinopoli, /Secure Detection Using Binary Sensors/, *4th IFAC Workshop on Distributed Estimation and Control in Networked Systems*, Koblenz, Germany, Sep 25-26, 2013
17. Xiaofei Liu, Sergio Pequito, Soummya Kar, Yilin Mo, Bruno Sinopoli and A. Pedro Aguiar, /Minimum Robust Sensor Placement for Large Scale Linear Time-Invariant Systems: A Structured Systems Approach/, *4th IFAC Workshop on Distributed Estimation and Control in Networked Systems*, Koblenz, Germany, Sep 25-26, 2013
18. Duo Han, Yilin Mo, Junfeng Wu, Bruno Sinopoli and Ling Shi, /Stochastic Event-triggered Sensor Scheduling for Remote State Estimation/, *IEEE Conference on Decision and Control*, Florence, Italy, Dec 10-13, 2013
19. Yilin Mo and Bruno Sinopoli, /Robust Estimation in the Presence of Integrity Attacks/, *IEEE Conference on Decision and Control*, Florence, Italy, Dec 10-13, 2013
20. Yilin Mo and Emanuele Garone and Bruno Sinopoli, /LQG control with Markovian Packet Loss/, *European Control Conference*, Zurich, Switzerland, Jul 17-19, 2013 
21. Yilin Mo, Emanuele Garone, Ling Shi and Bruno Sinopoli, /Infinite-Horizon Sensor Scheduling for Estimation over Lossy Networks/, *IEEE Conference on Decision and Control*, Maui, USA, Dec 10-13, 2012
22. Yilin Mo, Emanuele Garone, Alessandro Casavola and Bruno Sinopoli, /Stochastic Sensor Scheduling in Wireless Sensor Networks with General Graph Topology/, *American Control Conference*, Maui, USA, Dec 10-13, 2012
23. Yilin Mo, Jo\atilde{}o Hespanha and Bruno Sinopoli, /Robust Detection in the Presence of Integrity Attacks/, *American Control Conference*, Montreal, Canada, Jun 27-29, 2012
24. Yilin Mo and Bruno Sinopoli, /Integrity Attacks on Cyber-Physical Systems/, *Conference on High Confidence Networked Systems, CPS Week*, Beijing, China, Apr 17-19, 2012
25. Yilin Mo and Bruno Sinopoli, /Kalman Filtering with Intermittent Observations: Critical Value for Second Order System/, *IFAC World Congress*, Milan, Italy, Aug 28-Sep 2, 2011
26. Rohan Chabukswar, Yilin Mo, and Bruno Sinopoli, /Detecting Integrity Attacks on SCADA Systems/, *IFAC World Congress*, Milan, Italy, Aug 28-Sep 2, 2011
27. Yilin Mo and Bruno Sinopoli, /Secure Data Transmission Protocol in Multi-Hop Sensor Networks/, *Workshop on Foundations of Dependable and Secure Cyber-Physical Systems, CPS Week*, Chicago, USA, Apr 11-14, 2011
28. Wei Wang and Yilin Mo and John A. Ozolek and Gustavo K. Rohde, /CHARACTERIZING MORPHOLOGY DIFFERENCES FROM IMAGE DATA USING A MODIFIED FISHER CRITERION/, *8th Ieee International Symposium on Biomedical Imaging*, Chicago, USA, Mar 30-Apr 2, 2011
29. Yilin Mo, Emanuele Garone, Alessandro Casavola, and Bruno Sinopoli, /Sensor Scheduling for Energy Constrained Estimation in Multi-Hop Wireless Sensor Networks/, *IEEE Conference on Decision and Control*, Atlanta, USA, Dec 15-17, 2010
30. Yilin Mo, Emanuele Garone, Alessandro Casavola, and Bruno Sinopoli, /False Data Injection Attacks against State Estimation in Wireless Sensor Networks/, *IEEE Conference on Decision and Control*, Atlanta, USA, Dec 15-17, 2010
31. Yilin Mo and Bruno Sinopoli, /Communication Complexity and Energy Efficient Consensus Algorithm/, *IFAC Workshop on Distributed Estimation and Control in Networked Systems*, Annecy, France, Sep 13-14, 2010
32. Le Xie, Yilin Mo, and Bruno Sinopoli, /False Data Injection Attacks in Electricity Markets/, *IEEE International Conference on Smart Grid Communications*, Gaithersburgh, USA, Oct 4-6, 2010
33. Yilin Mo and Bruno Sinopoli, [[./papers/scs2010.org][/False Data Injection Attacks in Control Systems/]], *First Workshop on Secure Control Systems, CPS Week*, Stockholm, Sweden, Apr 13-14, 2010
34. Yilin Mo and Bruno Sinopoli, /Secure Control Against Replay Attacks/, *Allerton Conference on Communication, Control, and Computing*, Monticello, USA, Sep 30-Oct 2 2009
35. Yilin Mo, Roberto Ambrosino, and Bruno Sinopoli, /A Convex Optimization Approach of Multi-Step Sensor Selection under Correlated Noise/, *Allerton Conference on Communication, Control, and Computing*, Monticello, USA, Sep 30-Oct 2009
36. Yilin Mo, Roberto Ambrosino, and Bruno Sinopoli, /Network Energy Minimization via Sensor Selection and Topology Control/, *IFAC Workshop on Distributed Estimation and Control in Networked Systems*, Venice, Italy, Sep 24-26, 2009
37. Yilin Mo and Ling Shi and Roberto Ambrosino and Bruno Sinopoli, /Network Lifetime Maximization via Sensor Selection/, *7th Asian Control Conference*, Hong Kong, China, Aug 27-29, 2009
38. Yilin Mo and Bruno Sinopoli, /A Characterization Of The Critical Value For Kalman Filtering With Intermittent Observations/, *IEEE Conference on Decision and Control*, Cancun, Mexico, Dec 9-11, 2008
