publication.html
---
layout: page
title: Publication
---

<p>
My <a href="https://scholar.google.com.sg/citations?user=UcpEexUAAAAJ">Google Scholar</a> and <a href="https://www.researchgate.net/profile/Yilin_Mo">Research Gate</a> Page.
</p>

<div id="outline-container-org021fed9" class="outline-2">
<h2 id="org021fed9">Journal Paper</h2>
<div class="outline-text-2" id="text-org021fed9">
<ol class="org-ol">
<li>Liang Xu, Yilin Mo and Lihua Xie, <i>Distributed Consensus over Markovian Packet Loss Channels</i>, <b>IEEE Transactions on Automatic Control</b>, Submitted</li>
<li>Xinghua Liu, Yilin Mo and Emanuele Garone, <i>Local Decompostion of Kalman Filters and Its Application for Secure State Estimation</i>, <b>IEEE Transactions on Automatic Control</b>, Submitted</li>
<li>Jiazheng Wang, Xiaoqiang Ren, Yilin Mo and Ling Shi, <i>Whittle's Index Policy for Dynamic Multi-channel Allocation for Remote State Estimation</i>, <b>IEEE Transactions on Automatic Control</b>, Submitted</li>
<li>Duo Han, Yilin Mo and Lihua Xie, <a href="papers/automatica-16-secureest.html"><i>Convex Optimization Based State Estimation against Sparse Integrity Attacks</i></a>, <b>IEEE Transactions on Automatic Control</b>, Accepted</li>
<li>Yorie Nakahira and Yilin Mo, <i>Attack-Resilient H2, H-infinity, and L1 State Estimator</i>, <b>IEEE Transactions on Automatic Control</b>, Available Online: <a href="10.1109/TAC.2018.2819686">10.1109/TAC.2018.2819686</a></li>
<li>Xiaoqiang Ren and Yilin Mo, <i>Secure Detection: Performance Metric and Sensor Deployment Strategy</i>, <b>IEEE Transactions on Signal Processing</b>, Sep 2018, Volume 66, Issue 17, Pages 4450-4460</li>
<li>Xiaoqiang Ren, Jiaqi Yan and Yilin Mo, <a href="papers/tsp-17-detection.html"><i>Binary Hypothesis Testing with Byzantine Sensors: Fundamental Trade-off Between Security and Efficiency</i></a>, <b>IEEE Transactions on Signal Processing</b>, Mar 2018, Volume 66, Issue 6, Pages 1454-1468</li>
<li>Duo Han, Junfeng Wu, Yilin Mo and Lihua Xie, <i>On Stochastic Sensor Network Scheduling for Multiple Processes</i>, <b>IEEE Transactions on Automatic Control</b>, Dec 2017, Volume 62, Issue 12, Pages 6633-6640</li>
<li>Liang Xu, Yilin Mo and Lihua Xie, <i>Mean Square Stabilization of Linear Discrete-time Systems over Power Constrained Fading Channels</i>, <b>IEEE Transactions on Automatic Control</b>, Dec 2017, Volume 62, Issue 12, Pages 6505-6512</li>
<li>Yilin Mo and Richard M. Murray, <a href="papers/tac-15-privacy.html"><i>Privacy Preserving Average Consensus</i></a>, <b>IEEE Transactions on Automatic Control</b>, Feb 2017, Volume 62, Issue 2, Pages 753-765</li>
<li>Sean Weerakkody, Yilin Mo, Bruno Sinopoli, Duo Han, Ling Shi, <i>Multi-Sensor Scheduling for State Estimation with Event-Based Stochastic Triggers</i>, <b>IEEE Transactions on Automatic Control</b>, Sept 2016, Volume 61, Issue 9, Pages 2695-2701</li>
<li>Yilin Mo and Bruno Sinopoli, <a href="./papers/tac-12-integrity.html"><i>On the Performance Degradation of Cyber-Physical Systems under Stealthy Integrity Attacks</i></a>, <b>IEEE Transactions on Automatic Control</b>, Sept 2016, Volume 61, Issue 9, Pages 2618-2624</li>
<li>Duo Han, Yilin Mo, Junfeng Wu and Ling Shi, <i>An Opportunistic Sensor Scheduling Solution to Remote State Estimation Over Multiple Channels</i>, <b>IEEE Transactions on Signal Processing</b>, Sept 2016, Volume 64, Issue 18, 4905-4917</li>
<li>Duo Han, Yilin Mo, Junfeng Wu, Sean Weerakkody, Bruno Sinopoli and Ling Shi, <a href="./papers/tac-13-event.html"><i>Stochastic Event-triggered Sensor Schedule for Remote State Estimation</i></a>, <b>IEEE Transactions on Automatic Control</b>, Oct 2015, Volume 60, Issue 10, Pages 2661-2675</li>
<li>Yilin Mo and Bruno Sinopoli, <i><a href="./papers/tac-15-est.html">Secure Estimation in the Presence of Integrity Attacks</a></i>, <b>IEEE Transactions on Automatic Control</b>, Apr 2015, Volume 60, Issue 4, Pages 1145-1151</li>
<li>Yilin Mo, Sean Weerakkody and Bruno Sinopoli, <i><a href="./papers/cms-15-replay.html">Physical Authentication of Control Systems: Designing Watermarked Control Inputs to Detect Counterfeit Sensor Outputs</a></i>, <b>IEEE Control Systems Magazine</b>, Feb 2015, Volume 35, Issue 1, Pages 93-109</li>
<li>Yilin Mo, Rohan Chabukswar and Bruno Sinopoli, <i><a href="./papers/tcst-14-replay.html">Detecting Integrity Attacks on SCADA Systems</a></i>, <b>IEEE Transactions on Control System Technology</b>, Jul 2014, Volume 22, Issue 4, 1396-1407</li>
<li>Kyriakos Vamvoudakis, Jo&atilde;o Hespanha, Yilin Mo and Bruno Sinopoli, <i><a href="./papers/tac-14-detection.html">Detection in Adversarial Environments</a></i>, <b>IEEE Transactions on Automatic Control, Special Issue on Control of Cyber-Physical Systems</b>, Dec 2014, Volume 59, Issue 12, Special Issue S1, Pages 3209-3223</li>
<li>Yilin Mo, Emanuele Garone and Bruno Sinopoli, <i><a href="./papers/scl-14-optschedule.html">On Infinite-Horizon Sensor Scheduling</a></i>, <b>System &amp; Control Letters</b>, May 2014, Volume 67, Pages 65-70,</li>
<li>Yilin Mo, Jo&atilde;o Hespanha and Bruno Sinopoli, <i><a href="./papers/tsp-14-detection.html">Resilient Detection in the Presence of Integrity Attacks</a></i>, <b>IEEE Transactions on Signal Processing</b>, Jan 2014, Volume 62, Issue 1, Pages 31-43</li>
<li>Qing-Shan Jia, Ling Shi, Yilin Mo and Bruno Sinopoli, <i><a href="./papers/tac-12-wsn.html">On Optimal Partial Broadcasting of Wireless Sensor Networks for Kalman Filtering</a></i>, <b>IEEE Transactions on Automatic Control</b>, Mar 2012, Volum 57, Issue 3, Pages 715-721</li>
<li>Yilin Mo and Bruno Sinopoli, <i><a href="./papers/tac12.html">Kalman Filtering with Intermittent Observations: Tail Distribution and Critical Value</a></i>, <b>IEEE Transactions on Automatic Control</b>, Mar 2012, Volume 57, Issue 3, Pages 677-689</li>
<li>Yilin Mo, Tiffany Hyun-Jin Kim, Kenneth Brancik, Dona Dickinson, Heejo Lee, Adrian Perrig and Bruno Sinopoli, <i><a href="./papers/proc-ieee-12-smartgrid.html">Cyber-Physical Security of a Smart Grid Infrastructure</a></i>, <b>Proceedings of the IEEE, Special Issue on Cyber-Physical Systems</b>, Jan 2012, Volume 100, Issue 1, Pages 195-209</li>
<li>Le Xie, Yilin Mo and Bruno Sinopoli, <i><a href="./papers/tsg-11-integrity.html">Integrity Data Attacks in Power Market Operations</a></i>, <b>IEEE Transactions on Smart Grid</b>, Dec 2011, Volume 2, Issue 4, Pages 659-666</li>
<li>Wei Wang, Yilin Mo, John A. Ozolek, Gustavo K. Rohde, <i><a href="./papers/prl-11-fisherdiscriminant.html">Penalized Fisher Discriminant Analysis and Its Application to Image-based Morphometry</a></i>, <b>Pattern Recognition Letters</b>, Nov 2011, Volume 32, Issue 15, Pages 2128-2135</li>
<li>Yilin Mo, Emanuele Garone, Alessandro Casavola and Bruno Sinopoli, <i><a href="./papers/tac-11-scheduling.html">Stochastic Sensor Scheduling for Energy Constrained Estimation in Multi-Hop Wireless Sensor Networks</a></i>, <b>IEEE Transactions on Automatic Control</b>, Oct 2011, Volume 56, Issue 10, Pages 2489-2495</li>
<li>Yilin Mo, Roberto Ambrosino and Bruno Sinopoli, <i><a href="./papers/automatica-11-scheduling.html">Sensor Selection Strategies for State Estimation in Energy Constrained Wireless Sensor Networks</a></i>, <b>Automatica</b>, July 2011, Volume 47, Issue 7, Pages 1330-1338</li>
<li>Ling Shi, Qing-Shan Jia, Yilin Mo and Bruno Sinopoli, <i><a href="./papers/automatica-11-delay.html">Sensor Scheduling over a Packet-Delaying Network</a></i>, <b>Automatica</b>, May 2011, Volume 47, Issue 5, Pages 1089-1092</li>
</ol>
</div>
</div>

<div id="outline-container-org86f0450" class="outline-2">
<h2 id="org86f0450">Selected Conference Paper</h2>
<div class="outline-text-2" id="text-org86f0450">
<ol class="org-ol">
<li>Hanxiao Liu, Jiaqi Yan, Yilin Mo and Karl H. Johansson, <i>An On-line Design of Physical Watermarks</i>, <b>IEEE Conference on Decision and Control</b>, Miami, United States, Dec 17-19, 2018</li>
<li>Jiaqi Yan, Xiaoqiang Ren and Yilin Mo, <a href="./papers/cdc17-1.html"><i>Sequential Detection in Adversarial Environment</i></a>, <b>IEEE Conference on Decision and Control</b>, Melbourne, Australia, Dec 12-15, 2017</li>
<li>Xinghua Liu, Yilin Mo and Emanuele Garone, <i>Secure Dynamic State Estimation by Decomposing Kalman Filter</i>, <b>IFAC World Congress</b>, Toulouse, France, Jul 9-14, 2017</li>
<li>Yilin Mo and Emanuele Garone, <a href="./papers/cdc16-1.html"><i>Secure Dynamic State Estimation via Local Estimators</i></a>, <b>IEEE Conference on Decision and Control</b>, Las Vegas, USA, Dec 12-14, 2016</li>
<li>Duo Han, Yilin Mo and Lihua Xie, <a href="./papers/acc16-1.html"><i>Convex Optimization Based State Estimation against Sparse Integrity Attacks</i></a>, <b>Chinese Control Conference</b>, Chengdu, China, Jul 27-29, 2016</li>
<li>Liang Xu, Yilin Mo and Lihua Xie, <i>Mean Square Stabilization of Vector LTI Systems over Power Constrained Lossy Channels</i>, <b>American Control Conference</b>, Boston, USA, Jul 6-8, 2016</li>
<li>Ye Yuan and Yilin Mo, <i><a href="./papers/cdc15-1.html">Security in Cyber-Physical Systems: Controller Design Against Known-Plaintext Attack</a></i>, <b>IEEE Conference on Decision and Control</b>, Osaka, Dec 15-18, 2015</li>
<li>Yorie Nakahira and Yilin Mo, <i><a href="./papers/cdc15-2.html">Dyanmic State Estimation in the Presence of Compromised Sensory Data</a></i>, <b>IEEE Conference on Decision and Control</b>, Osaka, Dec 15-18, 2015</li>
<li>Robert Mattila, Yilin Mo and Richard M. Murray, <i>An Iterative Abstraction Algorithm for Reactive Correct-by-Construction Controller Synthesis</i>, <b>IEEE Conference on Decision and Control</b>, Osaka, Dec 15-18, 2015</li>
<li>Xiaoming Duan, Jianping He, Peng Cheng, Yilin Mo and Jiming Chen, <i>Privacy Preserving Maximum Consensus</i>, <b>IEEE Conference on Decision and Control</b>, Osaka, Dec 15-18, 2015</li>
<li>Yilin Mo and Richard M. Murray, <a href="./papers/ccc15.html"><i>Multi-dimensional state estimation in adversarial environment</i></a>, <b>Chinese Control Conference</b>, Hangzhou, China, Jul 28-30, 2015</li>
<li>Yilin Mo and Richard M. Murray, <i>Privacy Preserving Average Consensus</i>, <b>IEEE Conference on Decision and Control</b>, Los Angeles, Dec 15-17, 2014</li>
<li>Sean Weerakkody, Yilin Mo and Bruno Sinopoli, <i>Detecting Integrity Attacks on Control Systems Using Robust Physical Watermarking</i>, <b>IEEE Conference on Decision and Control</b>, Los Angeles, Dec 15-17, 2014</li>
<li>Xiaoqiang Ren, Yilin Mo and Ling Shi, <i>Optimal DoS Attack on Bayesian Quickest Change Detection</i>, <b>IEEE Conference on Decision and Control</b>, Los Angeles, Dec 15-17, 2014</li>
<li>Sean Weerakkody, Yilin Mo, Bruno Sinopoli, Duo Han and Ling Shi, <i>Multi-Sensor Scheduling for State Estimation with Event-Based, Stochastic Triggers</i>, <b>4th IFAC Workshop on Distributed Estimation and Control in Networked Systems</b>, Koblenz, Germany, Sep 25-26, 2013</li>
<li>Rohan Chabukswar, Yilin Mo and Bruno Sinopoli, <i>Secure Detection Using Binary Sensors</i>, <b>4th IFAC Workshop on Distributed Estimation and Control in Networked Systems</b>, Koblenz, Germany, Sep 25-26, 2013</li>
<li>Xiaofei Liu, Sergio Pequito, Soummya Kar, Yilin Mo, Bruno Sinopoli and A. Pedro Aguiar, <i>Minimum Robust Sensor Placement for Large Scale Linear Time-Invariant Systems: A Structured Systems Approach</i>, <b>4th IFAC Workshop on Distributed Estimation and Control in Networked Systems</b>, Koblenz, Germany, Sep 25-26, 2013</li>
<li>Duo Han, Yilin Mo, Junfeng Wu, Bruno Sinopoli and Ling Shi, <i>Stochastic Event-triggered Sensor Scheduling for Remote State Estimation</i>, <b>IEEE Conference on Decision and Control</b>, Florence, Italy, Dec 10-13, 2013</li>
<li>Yilin Mo and Bruno Sinopoli, <i>Robust Estimation in the Presence of Integrity Attacks</i>, <b>IEEE Conference on Decision and Control</b>, Florence, Italy, Dec 10-13, 2013</li>
<li>Yilin Mo and Emanuele Garone and Bruno Sinopoli, <i>LQG control with Markovian Packet Loss</i>, <b>European Control Conference</b>, Zurich, Switzerland, Jul 17-19, 2013</li>
<li>Yilin Mo, Emanuele Garone, Ling Shi and Bruno Sinopoli, <i>Infinite-Horizon Sensor Scheduling for Estimation over Lossy Networks</i>, <b>IEEE Conference on Decision and Control</b>, Maui, USA, Dec 10-13, 2012</li>
<li>Yilin Mo, Emanuele Garone, Alessandro Casavola and Bruno Sinopoli, <i>Stochastic Sensor Scheduling in Wireless Sensor Networks with General Graph Topology</i>, <b>American Control Conference</b>, Maui, USA, Dec 10-13, 2012</li>
<li>Yilin Mo, Jo&atilde;o Hespanha and Bruno Sinopoli, <i>Robust Detection in the Presence of Integrity Attacks</i>, <b>American Control Conference</b>, Montreal, Canada, Jun 27-29, 2012</li>
<li>Yilin Mo and Bruno Sinopoli, <i>Integrity Attacks on Cyber-Physical Systems</i>, <b>Conference on High Confidence Networked Systems, CPS Week</b>, Beijing, China, Apr 17-19, 2012</li>
<li>Yilin Mo and Bruno Sinopoli, <i>Kalman Filtering with Intermittent Observations: Critical Value for Second Order System</i>, <b>IFAC World Congress</b>, Milan, Italy, Aug 28-Sep 2, 2011</li>
<li>Rohan Chabukswar, Yilin Mo, and Bruno Sinopoli, <i>Detecting Integrity Attacks on SCADA Systems</i>, <b>IFAC World Congress</b>, Milan, Italy, Aug 28-Sep 2, 2011</li>
<li>Yilin Mo and Bruno Sinopoli, <i>Secure Data Transmission Protocol in Multi-Hop Sensor Networks</i>, <b>Workshop on Foundations of Dependable and Secure Cyber-Physical Systems, CPS Week</b>, Chicago, USA, Apr 11-14, 2011</li>
<li>Wei Wang and Yilin Mo and John A. Ozolek and Gustavo K. Rohde, <i>CHARACTERIZING MORPHOLOGY DIFFERENCES FROM IMAGE DATA USING A MODIFIED FISHER CRITERION</i>, <b>8th Ieee International Symposium on Biomedical Imaging</b>, Chicago, USA, Mar 30-Apr 2, 2011</li>
<li>Yilin Mo, Emanuele Garone, Alessandro Casavola, and Bruno Sinopoli, <i>Sensor Scheduling for Energy Constrained Estimation in Multi-Hop Wireless Sensor Networks</i>, <b>IEEE Conference on Decision and Control</b>, Atlanta, USA, Dec 15-17, 2010</li>
<li>Yilin Mo, Emanuele Garone, Alessandro Casavola, and Bruno Sinopoli, <i>False Data Injection Attacks against State Estimation in Wireless Sensor Networks</i>, <b>IEEE Conference on Decision and Control</b>, Atlanta, USA, Dec 15-17, 2010</li>
<li>Yilin Mo and Bruno Sinopoli, <i>Communication Complexity and Energy Efficient Consensus Algorithm</i>, <b>IFAC Workshop on Distributed Estimation and Control in Networked Systems</b>, Annecy, France, Sep 13-14, 2010</li>
<li>Le Xie, Yilin Mo, and Bruno Sinopoli, <i>False Data Injection Attacks in Electricity Markets</i>, <b>IEEE International Conference on Smart Grid Communications</b>, Gaithersburgh, USA, Oct 4-6, 2010</li>
<li>Yilin Mo and Bruno Sinopoli, <a href="./papers/scs2010.html"><i>False Data Injection Attacks in Control Systems</i></a>, <b>First Workshop on Secure Control Systems, CPS Week</b>, Stockholm, Sweden, Apr 13-14, 2010</li>
<li>Yilin Mo and Bruno Sinopoli, <i>Secure Control Against Replay Attacks</i>, <b>Allerton Conference on Communication, Control, and Computing</b>, Monticello, USA, Sep 30-Oct 2 2009</li>
<li>Yilin Mo, Roberto Ambrosino, and Bruno Sinopoli, <i>A Convex Optimization Approach of Multi-Step Sensor Selection under Correlated Noise</i>, <b>Allerton Conference on Communication, Control, and Computing</b>, Monticello, USA, Sep 30-Oct 2009</li>
<li>Yilin Mo, Roberto Ambrosino, and Bruno Sinopoli, <i>Network Energy Minimization via Sensor Selection and Topology Control</i>, <b>IFAC Workshop on Distributed Estimation and Control in Networked Systems</b>, Venice, Italy, Sep 24-26, 2009</li>
<li>Yilin Mo and Ling Shi and Roberto Ambrosino and Bruno Sinopoli, <i>Network Lifetime Maximization via Sensor Selection</i>, <b>7th Asian Control Conference</b>, Hong Kong, China, Aug 27-29, 2009</li>
<li>Yilin Mo and Bruno Sinopoli, <i>A Characterization Of The Critical Value For Kalman Filtering With Intermittent Observations</i>, <b>IEEE Conference on Decision and Control</b>, Cancun, Mexico, Dec 9-11, 2008</li>
</ol>
</div>
</div>
